app/controllers/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("title", "description", "status", "created_at", "updated_at") VALUES ('', '', '', '2025-05-22 18:18:05.458897', '2025-05-22 18:18:05.458897') RETURNING "id"

    def set_todo
      @todo = Todo.find(params.expect(:id))
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = 3 LIMIT 1